'''
http://www.s-anand.net/euler.html
Задача 2
Четные числа Фибоначчи

Каждый следующий элемент ряда Фибоначчи получается при сложении двух
предыдущих. Начиная с 1 и 2, первые 10 элементов будут:

1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...

Найдите сумму всех четных элементов ряда Фибоначчи, которые не превышают
четыре миллиона

Each new term in the Fibonacci sequence is generated by adding the previous
two terms. By starting with 1 and 2, the first 10 terms will be:

1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...

By considering the terms in the Fibonacci sequence whose values do not exceed
four million, find the sum of the even-valued terms.
'''

limit = 4000000


def eiler2():
    summa = 0
    fib_num = 0
    prev_num = 0
    next_num = 1
    while (fib_num <= limit):
        fib_num = prev_num + next_num
        prev_num = next_num
        next_num = fib_num
        if (fib_num % 2 == 0):
            summa += fib_num
    print("#2. Sum = {}".format(summa))


if __name__ == "__main__":
    eiler2()  # 4613732
